{"format": "layers-model", "generatedBy": "TensorFlow.js", "convertedBy": "Manual Conversion", "modelTopology": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batchInputShape": [null, 224, 224, 3]}, "inbound_connections": []}, {"class_name": "Dense", "config": {"name": "predictions", "units": 10, "activation": "softmax"}, "inbound_connections": [["input_1", 0, 0, {}]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layer_with_weights-0/kernel", "shape": [3], "dtype": "float32"}]}]}